# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\jmspi\OneDrive\Documents\GitHub\ECE4191\DeliveryRobot.cydsn\DeliveryRobot.cyprj
# Date: Tue, 05 Sep 2023 07:43:26 GMT
#set_units -time ns
create_clock -name {Clock_Motor_PI_Control(routed)} -period 2000000 -waveform {0 1000000} [list [get_pins {ClockBlock/dclk_3}]]
create_clock -name {Clock_Motor_Control(routed)} -period 20000000 -waveform {0 10000000} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {Clock_Testing_1(routed)} -period 100000000 -waveform {0 50000000} [list [get_pins {ClockBlock/dclk_6}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_Trigger} -source [get_pins {ClockBlock/clk_sync}] -edges {1 241 481} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 313 627} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {CLOCK_echo} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1413 2825} -nominal_period 58833.333333333328 [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {Clock_Motor_PI_Control} -source [get_pins {ClockBlock/clk_sync}] -edges {1 48001 96001} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Clock_Seconds} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2400001 4800001} [list [get_pins {ClockBlock/dclk_glb_5}]]
create_generated_clock -name {Clock_Testing_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2400001 4800001} [list [get_pins {ClockBlock/dclk_glb_6}]]
create_generated_clock -name {Clock_Motor_Control} -source [get_pins {ClockBlock/clk_sync}] -edges {1 480001 960001} [list [get_pins {ClockBlock/dclk_glb_4}]]


# Component constraints for C:\Users\jmspi\OneDrive\Documents\GitHub\ECE4191\DeliveryRobot.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\jmspi\OneDrive\Documents\GitHub\ECE4191\DeliveryRobot.cydsn\DeliveryRobot.cyprj
# Date: Tue, 05 Sep 2023 07:43:20 GMT
